; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	spectrograph5 - mode
	spectrograph2 - mode
	infrared1 - mode
	image4 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star2 - direction
	Star0 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 image4)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star5)
	(supports instrument6 spectrograph5)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star0)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument9 spectrograph5)
	(calibration_target instrument9 GroundStation7)
	(supports instrument10 image4)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 spectrograph5)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation6)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
	(supports instrument12 spectrograph5)
	(supports instrument12 image4)
	(calibration_target instrument12 Star2)
	(calibration_target instrument12 Star0)
	(supports instrument13 thermograph0)
	(supports instrument13 spectrograph2)
	(supports instrument13 spectrograph5)
	(calibration_target instrument13 Star0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 Star12)
	(pointing satellite4 Planet8)
	(pointing satellite5 GroundStation4)
	(have_image Planet8 infrared1)
	(have_image Planet8 image4)
	(have_image Star9 spectrograph5)
	(have_image Star9 image4)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 infrared3)
	(have_image Star12 infrared3)
))

)

; plan
1. (turn_to satellite5 star0 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 star0)
   goals met: 0 of 11
2. (turn_to satellite2 star12 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star12)
   goals met: 1 of 11
3. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 11
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 11
5. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 11
6. (turn_to satellite0 star12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star12)
   goals met: 1 of 11
7. (take_image satellite0 star12 instrument0 infrared3)
   added: (have_image star12 infrared3)
   goals met: 2 of 11
8. (turn_to satellite0 planet8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet8)
   goals met: 2 of 11
9. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 3 of 11
10. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon11 instrument0 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 5 of 11
13. (switch_on instrument13 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument13)
   goals met: 5 of 11
14. (calibrate satellite5 instrument13 star0)
   added: (calibrated instrument13)
   goals met: 5 of 11
15. (turn_to satellite0 star9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star9)
   goals met: 5 of 11
16. (take_image satellite0 star9 instrument0 image4)
   added: (have_image star9 image4)
   goals met: 6 of 11
17. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 7 of 11
18. (turn_to satellite4 planet8 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 planet8)
   goals met: 8 of 11
19. (turn_to satellite5 planet10 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 planet10)
   goals met: 8 of 11
20. (take_image satellite5 planet10 instrument13 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 9 of 11
21. (turn_to satellite5 star9 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 star9)
   goals met: 9 of 11
22. (take_image satellite5 star9 instrument13 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 10 of 11
23. (turn_to satellite5 groundstation4 star9)
   deleted: (pointing satellite5 star9)
   added: (pointing satellite5 groundstation4)
   goals met: 11 of 11
